#!/bin/zsh

PATH_TO_CLIENT="./client"

# Colors
Black='\e[0;30m'
D_Gray='\e[1;30m'
Red='\e[0;31m'
L_Red='\e[1;31m'
Green='\e[0;32m'
L_Green='\e[1;32m'
Orange='\e[0;33m'
Yellow='\e[1;33m'
Blue='\e[0;34m'
L_Blue='\e[1;34m'
Purple='\e[0;35m'
L_Purple='\e[1;35m'
Cyan='\e[0;36m'
L_Cyan='\e[1;36m'
L_Gray='\e[0;37m'
White='\e[1;37m'
NC='\e[0m' 

###################
# Preparing tests #
###################

for init in tm tb t2 t3 t4 t5 t6 p_id
do
    export $init=0
done

for i in $@
do
    case $i in
        -m) tm=1;;
        -b) tb=1;;
        "-1") t1=1;;
        "-2") t2=1;;
        "-3") t3=1;;
        "-4") t4=1;;
        "-5") t5=1;;
        "-6") t6=1;;
		"-7") t7=1;;
		"-8") t8=1;;
        *) if [[ $p_id = 0 ]] ; then p_id=$i; else echo "[ERROR] Please enter correct arg when launching."; exit; fi;;
    esac
done

if ! [[ $p_id =~ [0-9]+ ]]
then 
    echo "[ERROR] Please enter correct arg when launching."
    exit
fi


###########
# Testing #
###########

######## SPEED TEST #########

echo "${L_Green} [Speed test]\tTime to print 1 000 char ${NC}"
time $PATH_TO_CLIENT $p_id "...................................................................................................
...................................................................................................
...................................................................................................
...................................................................................................
...................................................................................................
...................................................................................................
...................................................................................................
...................................................................................................
...................................................................................................
...................................................................................................
"

echo "${L_Green} [Speed test]\tTime to print 100 char ${NC}"
time $PATH_TO_CLIENT $p_id "...................................................................................................."


######## MANDATORY #########

### Test 1 ###
if [[ $t1 == 1 || $tm == 1 ]]
then
    echo "${L_Green} [Test 1]\tBasic test ${NC}"
    time $PATH_TO_CLIENT $p_id "Hello, this is a first test" 
fi

### Test 2 ###
if [[ $t2 == 1 || $tm == 1 ]]
then
    echo "${L_Green}\n [Test 2]\tEmpty string${NC}"
    time $PATH_TO_CLIENT $p_id "" 
fi

### Test 3 ###
if [[ $t3 == 1 || $tm == 1 ]]
then
    echo "${L_Green}\n [Test 3]\tSending big str with 20 000 char${NC}"
    time $PATH_TO_CLIENT $p_id "

                                               LL             A
                                               LL            A A
                                               LL           AA AA
                                               LL          AA   AA
                                               LL          AAAAAAA
                                               LL         AA     AA
                                               LL         AA     AA
                                               LLLLLLLLL  AA     AA
                                               LLLLLLLLL  AA     AA
TTTTTTTTTT   OOOOOOO   UU     UU  RRRRRRR              EEEEEEEEE  IIIIIIIIII  FFFFFFFFF  FFFFFFFFF  EEEEEEEEE  LL
TTTTTTTT  OOOOOOOOO  UU     UU  RRRRRRRR             EEEEEEEEE  IIIIIIIIII  FFFFFFFFF  FFFFFFFFF  EEEEEEEEE  LL
  TT      OO     OO  UU     UU  RR     RR            EE             II      FF         FF         EE         LL
  TT      OO     OO  UU     UU  RR     RR            EE             II      FF         FF         EE         LL
  TT      OO     OO  UU     UU  RRRRRRRR             EEEEEEEE       II      FFFFFFFF   FFFFFFFF   EEEEEEEE   LL
  TT      OO     OO  UU     UU  RR  RR               EE             II      FF         FF         EE         LL
  TT      OO     OO  UU     UU  RR   RR              EE             II      FF         FF         EE         LL
  TT      OOOOOOOOO  UUUUUUUUU  RR    RR             EEEEEEEEE  IIIIIIIIII  FF         FF         EEEEEEEEE  LLLLLLLLL
  TT       OOOOOOO    UUUUUUU   RR     RR            EEEEEEEEE  IIIIIIIIII  FF         FF         EEEEEEEEE  LLLLLLLLL
                                                         .
                                                         1
                                                         1
                                                         1
                                                         M
                                                         M
                                                         M
                                                         M
                                                        \\M/
                                                     . ' M \` .
                                                   \\##-#####-##/
                                                    \\# ##### #/
                                                  ###############
                                                  ###############
                                                   \\ ! ! ! ! ! /
                                                    )! ! ! ! !(
                                                    +---------+
                                                    +! ! ! ! !+
                                                    +----*----+
                                                   +\`. .':\`. .'+
                                                   + .^. : .^. +
                                                   +:...:*:...:+
                                                   +\`. .':\`. .'+
                                                   + .^. : .^. +
                                                   +:...:*:...:+
                                                   +\`. .':\`. .'+
                                                   +. ^. : .^ .+
                                                  +:....:*:....:+
                                                  +\` .  ':\`  . '+
                                                  +  .^. : .^.  +
                                                  +:....:*:....:+
                                                  +\` .. ':\` .. '+
                                                  +. '\` .:. '\` .+
                                                  +:....:*:....:+
                                                  + \`. .':\`. .' +
                                                  +   X  :  X   +
                                                  +.'  \`.:.'  \`.+
                                                 +:......*......:+
                                                 +\`.   .':\`.   .'+
                                                 +   X   :   X   +
                                                 + .' \`. : .' \`. +
                                                 +.......*.......+
                                                 +\` . . ':\` . . '+
                                                 +   X   :   X   +
                                                 + '   \` : '   \` +
                                                 +../########....+
                                                 +\`/#########\\ .'+
                                                +  ############   +
                                                + '############\`  +
                                                +:.......*.......:+
                                                + \` .  ' : \`  . ' +
                                                +    X   :   X    +
                                                + .'   \`.:.'   \`. +
                                                +:.......*.......:+
                                                +\`      ':\`      '+
                                               +  \`   '  :  \`   '  +
                                               +    X   : :   X    +
                                               +  '   \` : : '   \`  +
                                               +:.......*.*.......:+
                                               +\`      ': :\`      '+
                                               + \`   '  : :  \`   ' +
                                               +   X   : X :   X   +
                                              +  '   \` :' \`: '   \`  +
                                              +:.......*...*.......:+
                                              +\`      ':\` ':\`      '+
                                              + \`   '  : X :  \`   ' +
                                              +   X   :     :   X   +
                                              + '   \` :/   \\: '   \` +
                                             +:.......*.....*.......:+
                                             +\`      ':\`   ':\`      '+
                                             + \`   '  : \`.' :  \`   ' +
                                            +    X   :  ' \`  :   X    +
                                            +  '   \` :'     \`: '   \`  +
                                            +:.......*.......*.......:+
                                           + \`      ':\`     ':\`      ' +
                                           +  \` . '  :  \`.'  :  \` . '  +
                                          +    ' \`  :   ' \`   :  ' \`    +
                                          +. '    \` : '     \` : '    \` .+
                                         +..........*.........*..........+
                                         +  ###########################  +
                                         +  ###########################  +
                                        +   ###########################   +
                                     #########################################
                                    ###########################################
                                     \\   1   1   1   1   1   1   1   1   1   /
                                      )  1   1   1   1   1   1   1   1   1  (
                                      +-----:-----+-------------+-----:-----+
                                      +     :     +             +     :     +
                                     *------*-----*-------------*-----*------*
                                     +XXXXXXXXXXX+XXXXXXXXXXXXXXX+XXXXXXXXXXX+
                                     *-----*-----*---------------*-----*-----*
                                    + \`.   :  . '+               +\` .  :   .' +
                                    +    . : '   +               +   \` : .    +
                                   +    . *.    +                 +    .* .    +
                                   + . '  : \`.  +                 +  .' :  \` . +
                                  *:......*....:*                 *:....*......:*
                                  + \`.   :   . '+                 +\` .   :   .' +
                                 +     \`.:. '  +                   +  \` .:.'     +
                                 +   . '* \`.   +                   +   .' *\` .   +
                                + . '   :    \`.+                   +.'    :   \` . +
                                *:.....*.......*                   *.......*.....:*
                               +  \` .. :  .. ' +                   + \` ..  : .. '  +
                               +     . *'     +                     +     \`* .     +
                              +  .. ' :   \` . +                     + . '   : \` ..  +
                              *.:....*.......:*                     *:.......*....:.*
                             +   \` ..: . - '  +                     +  \` - . :.. '   +
                             +    .. * ..    +                       +    .. * ..    +
                        -------------------------------------------------------------------
                          1 +:       :      +:       :       :       :+      :       :+ 1
                          1+ :       :      +:       :       :       :+      :       : +1
                        ###################################################################
                         1   1   1   1   1   1   1   1   1   1   1   1   1   1   1   1   1
                         1   1   1   1   1   1   1   1   1   1   1   1   1   1   1   1   1
                         +---------------------------------------------------------------+
                        +! . ! . ! . ! . !+. ! . ! . ! . ! . ! . ! . ! .+! . ! . ! . ! . !+
                       +:!: :!: :!: :!: :!+ :!: :!: :!: :!: :!: :!: :!: +!: :!: :!: :!: :!:+
                       +.!.:.!.:.!.:.!.:.!+:.!.:.!.:.!.:.!.:.!.:.!.:.!.:+!.:.!.:.!.:.!.:.!.+
                      +XXXXXXXXXXXXXXXXXX+\\     \\  ..-#######-..  /     /+XXXXXXXXXXXXXXXXXX+
                     *-------------------* \\    .-' \\  1 1 1  / \`-.    / *-------------------*
                     +  \` .    : ..  '  +   \\.-' \\   .-------.   / \`-./   +  \`  .. :    . '  +
                    +.......:.*:........+ .-' \\  .-''         \`\`-.  / \`-. +........:*.:.......+
                   +    .  '  : \` .    +\\:  \\  -'                 \`-  /  :/+    . ' :  \`  .    +
                   +..:.......:.....:..+/ \\ .-'                     \`-. / \\+..:.....:.......:..+
                  +    \` .   :    .  ' + \\.'                           \`./ + \`  .    :   . '    +
                 +.........:.*..:.....+  /                               \\  +.....:..*.:.........+
                +     .  '  :   \` .   + /                                 \\ +   . '   :  \`  .     +
                +...:......:........:+ /                                   \\ +:........:..........+
               +    \`  .  :  .  '    +/                                     \\+    \`  .  :  .  '    +
              +...........*.........+                                         +.........*...........+
             +     .  '  :   \`  .   +                                         +   .  '   :  \`  .     +
            +...:.......:.........:+                                           +:.........:.......:...+
           +    \`  .    :   .   '  +                                           +  \`   .   :    .  '    +
          +..........:.*.:........+                                             +........:.*.:..........+
         +     .   '  :   \`  .    +                                             +    .  '   :  \`   .     +
        +...:.........:.........:+                                               +:.........:.........:...+
       +   \`   .     :     .   ' +                                               + \`   .     :     .   '   +
      +...........:.*..:........+                                                 +........:..*.:...........+
     +      .   '  :   \`  .     +                                                 +     .  '   :  \`   .      +
    +...:.........:..........:.+                                                   +.:..........:.........:...+
   +     \`  .     :      .  ' +                                                     + \`  .      :     .  '     +
  +            \` *  - '      +                                                       +      \` -  * '            +
 -----------------------------------------------------------------------------------------------------------------                        
"
fi

### Test 4 ###
if [[ $t4 == 1 || $tm == 1 ]]
then
    echo "${L_Green}\n [Test 4]\tTrying to crash your exhange Server-Client, sending str with 3 000 char (15 times) ${NC}"

    for i in {1..15}
    do
        echo -n "${Green} [ ${i} ]${NC}"
        $PATH_TO_CLIENT $p_id "
             .-\"\"\"-.                                     .--..--..--..--..--..--.
            /       \\                                  .' \\  (\`._   (_)     _   \\
            \\       /                                .'    |  '._)         (_)  |
     .-\"\"\"-.-\`.-.-.<  _                              \\ _.')\\      .----..---.   /
    /      _,-\\ O_O-_/ )                             |(_.'  |    /    .-\\-.  \\  |
    \\     / ,  \`   . \`|                              \\     0|    |   ( O| O) | o|
     '-..-| \\-.,__~ ~ /                               |  _  |  .--.____.'._.-.  |
           \\ \`-.__/  /                                \\ (_) | o         -\` .-\`  |
          / \`-.__.-\\\`-._    ,\",                        |    \\   |\`-._ _ _ _ _\\ /
         / /|    ___\\-._\`-.;  , .----.                 \\    |   |  \`. |_||_|   |
        ( ( |.-\"\`   \`'\\ '-(     -.---'                 | o  |    \\_      \\     |     -.   .-.
         \\ \\/    {}{}  |   \\.__.-'                     |.-.  \\     \`--..-'   O |     \`.\`-' .'
          \\|           /                             _.'  .' |     \`-.-'      /-.__   ' .-'
           \\        , /                            .' \`-.\` '.|='=.='=.='=.='=|._/_ \`-'.'
           ( __\`;-;'__\`)                           \`-._  \`.  |________/\\_____|    \`-.'
           \`//'\`   \`||\`                               .'   ).| '=' '='\\/ '=' |
          _//       ||                                \`._.\`  '---------------'
  .-\"-._,(__)     .(__).-\"\"-.                                 //___\\   //___\\
 /          \\    /           \\                                  ||       ||
 \\          /    \\           /                                  ||_.-.   ||_.-.
  \`'-------\`      \`--------'\`                                  (_.--__) (_.--__)
" 
    done
fi

######## BONUS #########

### Test 5 ###
if [[ $t5 == 1 || $tb == 1 ]]
then
    echo "${L_Green}\n [Test 5]\tGuess the movie with emojis ${NC}"

    $PATH_TO_CLIENT $p_id "
     ⛴️  +  🌊  + 💥 = ❓
     👦 +  👽  + 🚲 = ❓
     🏰 +  ❄️   + 👭 = ❓
    " 
fi

### Test 6 ###
if [[ $t6 == 1 || $tb == 1 ]]
then
    echo "${L_Green}\n [Test 6]\tTesting the connexion between server-client, sending str with 5 300 char (10 times)${NC}"
    for i in {1..10}
    do
        echo -n "${L_Green} [ ${i} ]${NC}"
        time $PATH_TO_CLIENT $p_id "
        ░░░░░░░░░░░░░░░░░░░▒▓▓█████████████▓▓▒░░░░░░░░░░░░░░░░░░░░░░
        ░░░░░░░░░░░░░░▒████▓▓▒▒░▒▒▒░▒▒▒▒▒▒▓▓████▓▒░░░░░░░░░░░░░░░░░░
        ░░░░░░░░░░░▒███▓░░░░░░░░░░░░░░░░░░░░░░▒███████▓▓▒░░░░░░░░░░░
        ░░░░░░░░░▒██▓░░░░▒▒███▓▓▒░░░░░░░░░░░░░▓▓▒▒▒▒▒▓██████▓░░░░░░░
        ░░░░░░░▒██▓░░░▓███▓▒░░░░░░░░▒▒▒▒▒▒▒▒▒▒░░░░░░▒▓▓███▓████▒▒░░░
        ░░░░░░██▓░░▒▓██▓░░▒▓██████▓░░░░░░░▒░░░░░░▒██▓▒░░░▓███▒▓▒░░░░
        ░░░░░██░░▓███▒░░▒██▒░░░░▒▒██▓░░░░░░░░░░░██▒░░░░▒████▒█░░░░░░
        ░░░░██░▒▓▒▓▓░░░██░░░░░░░░░░░█▓░░░░░░░░░██░░░░░░▒███░░█▒░░░░░
        ░░░▓█░░░░░░░░░██░░░░░░░░░░░░▓█░░░░░░░░██░░░░░░░░░░░░░█▒░░░░░
        ░░░█▓░░░░░░░░░█▒░░████░░░░░░░█▒░░░░░░░██░░░░░░░░░░░░███░░░░░
        ░░▒█░░░░░░░▒▓▒█▓░▓████▓░░░░░▒█░░░░░░░░▒█▒░░░░░░░░░░██░█▒░░░░
        ░░██░░░░░▒▓▒▓▒██▒▒▓▓▓░░░░░░░██░░░░░░░░░▒████▓███████▓░█▒░░░░
        ░░█▓░░░░░▒░░░▒░▒██▓▒░░░░░▒██▓░░░░░░░░░░░░░░██▓░░░░░░▒██▓░░░░
        ░░█░░░░░░░░░▓▒░░░░▒▓██████▓░░░░░░░░░░░░░░▒██░░░▓█▓▓▒░░░██░░░
        ░▒█░░░░░░░░░░░░░░░░░░░░░░░░░░▓▒▓▒▒▒▒▒▓▓▓▓██░░▓█▓░▒▒██▒░░██░░
        ░▓█░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▓▓▒░░██░░██▓░▒░▒░██░░▒█░░
        ░██░░░░░░░░░░░░░░░░░░░░░░░▒▓▒▒▒▒▒▒▒▒░░░██░░▓█░█▓░█▒█▓█▓░░█░░
        ░██░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒░▒▒░░▓█▓░░██░█▒▒█▒█▒▓█░░█░░
        ░██░░░░░░░░░░░░░░░░░░░░░░░░▒░░░░░░░░░░▓█░░░█▒░░░░▒▒░░▒█░▓█░░
        ░▒█░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒░░█▒░░█▒░░░░░░░░▓█░█▓░░
        ░░█▓░▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▓█░░█▒░░░░░░░░█░▒█░░░
        ░░▓█░░▒░░▒▒░░▒░░░░░░░░░░░░░░░░░░░░░░░░░░█░░█▒░░░░░░░█▓░█▓░░░
        ░░░█▒░░▒░░▒░░▒▒░░░░░░░░░░░░░░░░░░░░░░░░░█░░█▒░░░░░░▓█░░█░░░░
        ░░░██░░░▒░▒░░░▒▒░░░░░░░░░░░░░░░░░░░░░░░░█░░█▒░░░░░░██░░█░░░░
        ░░░░█▓░░░▒░▒░░░░▒▒░░░░░▒▒▒▒▒▒░░░░░░░░░░▒█░▒█░░░░░░░█▒░░█▓░░░
        ░░░░▓█░░░░▒▒░░░░░▒▒░░░░░░▒▒▒▓▓▓▒░░░░░░░██░██░░░░░░░██░░▓█░░░
        ░░░░░██░░░▒░▒░░░░░▒░░░░░░░░▒░▒▒▓█▒░░░░▒█░░█▓▒▓▓▓▒░░▓█░░░█▒░░
        ░░░░░▒█▒░░░▒▒▒░░░░▒░░░░░░░░░░▒▒▒░▒▓░░░██░▒█░░░░▒▓▓░░██░░█▒░░
        ░░░░░░▒█▒░░░▒░▒░░░▒░░░░░░▒▒▒░░░░▒▒░░░▒█░░██░░░░░░░█░▒█░░█▒░░
        ░░░░░░░▓█░░░▒░▒░░░░▒▒░░░░▓▒▒▓▓▓▒░░▓▒░██░░██▒▒▒▒▓▒▓▓███░░█▒░░
        ░░░░░░░░██░░░▒░▒░░░░░▒▒░░░░░░░░▓█▓░░░█▓░░██░▓█░█░█░░█▒░░█▒░░
        ░░░░░░░░░██░░░░▒▒░░░░░░▒▒░░░░░░░░▒█▓░█▓░░▓█▒▒█▒█░█▒██░░▒█░░░
        ░░░░░░░░░░██▒░░░░▒░░░▒░░░▒▒░░░░░░░░▒▓██░░░██░░░░▒▒██░░░██░░░
        ░░░░░░░░░░░▓██░░░░░░░░▒▒░░░▒░░░░░░░░░▓█░░░░▓███▓▓██░░░██░░░░
        ░░░░░░░░░░░░░▓██▒░░░░░░▒▒▒▒▒░░░░░░░░░░██░░░░░░▒▒▒░░░░██░░░░░
        ░░░░░░░░░░░░░░░▓███▒░░░░░░░▒▒▒▒▒▒▒▒░░░░▓██▒░░░░░░░▒███░░░░░░
        ░░░░░░░░░░░░░░░░░▒▓███▓▒░░░░░░░▒░░▒▒▒▒░░░▒██▓██████▓░░░░░░░░
        ░░░░░░░░░░░░░░░░░░░░░▒████▓▒▒░░░░░░░░░░░░░░░▓██▒░░░░░░░░░░░░
        ░░░░░░░░░░░░░░░░░░░░░░░░░▒▓████▓░░░░░░░▓█████▒░░░░░░░░░░░░░░
        ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒█████████▒░░░░░░░░░░░░░░░░░░░
        ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒░░░░░░░░░░░░░░░░░░░░░░░
        " 
    done
fi

### Test 7 ###
if [[ $t7 == 1 || $tb == 1 ]]
then
    echo "${L_Green}\n [Test 7]\tNIhongo TESTsu${NC}"

    $PATH_TO_CLIENT $p_id "テメユ礎済メ覧情速べ府愛ツワヌ庭民ぜ田覚ヲ意故大れげリフ耳止クフホ車階ア記監ぐ急日は基新本ょえせド幹退分且イさトふ。祝欲ぎ戦減ドゅてそ芸年ウワムル室本ねた段周どせづ欠年画ふね良術間わ集億コマ供97際寮尼ほこ。

会厨キウサユ造渡クへめけ発美スぶ全74瀬航きるっ結力アマオヒ設多な売禁じさぞ教意や所楽っぞわイ能第最道真リアテ線当ほなを紀3亨ゆごお。細条ルス覧山ソケワヌ優旅ねつ短格伝ンかじっ施分キナサロ卒刑ワオ分料リユ教標む通手戦ユクヘマ内決ナアヌロ支犯ごあくフ家6重ざほ問天先トヒル数勝るり域米マフタ逆栃いぼすう。

楽四へっー社落家秋け案意んびぱめ要井むふ勝果ナ集視順球ちルやさ渡混ヱ法偽作ルモヌ受事しぼけ転図る裏探丁侵ねべひ。済あらぎが暮日斐らぞ活大だリけ海暮つこ出断ゃ推俸クカミラ践62協コミ当前ラがド会度同マツセ他健複伐へ。載フキ概79様ツタコ一1角リハユ城予ごぼイっ慰給ニヱ覧新てょべ努対ケメウ都厚ナイト会歳セヘ転無っぞくろ識98季かぜそる柳引払縄ぴも。

上はゃぎぶ前59共西賀移5勤ユエ事分ヒキヲ隻報おぼ有現ソロハモ好供モウメヲ辞伴だそ続転ゅ型無をか休配ろれへぎ見来ソリロ挑学八ヌキケ表更びやス阪史泰テサネヤ警活チレ社順霊雄類果み。応どしゆめ止市ヒコ方篠ぎはどほ問64医ヲミ年女テシモネ提査メア化受ヒリウ却生ナオホク者短み去活達心ア転行翼ド売合かしね物躍る暴製わなちふ。

載いれー心消ハヤ心佐マクヘ著可店ゅ皇言ル朝盛リニフ測山モナヌセ死談ハソ全落ノイ向鍛なか森中にちん壌載読ハフオヨ紀入ルふ防価なふお位関ひ本7涼耕荘ま。意ょれ覚事輪ネリオ一治ヒ年済構リ減船テノマユ詳分ばせらわ広徴場エリムヲ捜士イをのほ究言戸は覧質指分磨でゅわぜ。92白之押旬4絵ひく日視カエツリ基文おッ治掲ヲアナ面54兵統ふたラ側麻じくづ付司7社やぎ産史ぼをがい襲迷ヨミ表減升忍ゃはの。

放ラヤサメ上古んいぽね記多ノタカ店野んせ策区ふぽせ格運イマユム転伎イ報談ハ護会ふへな保告をてがで円東おに自本ほ内建ネフモ化9住アヤ暮場どつお男問フム指設土宣ゅフゆ。30蕉シ見集ホ売仲属優引カロソ購良けど内軍討国コモオ年士うばも詳費れ置尋しほ禁景よスッ載新ぶ堂松花飛ゆひ。

講ノイ発内ぽょドべ区及ゅとほづ聞津ク機資ヤ切保ノテシミ教腺ウ外米季にぴかげ未3交ぜもけゃ警27更ぶ毒疑こぎクじ入76践ば川通っひ。欠しトじま頭禁ほげドー情氏金ルをト込全段オ国陸13代東地クヲ在欺ケスタ敵集討フクヤツ希真トん内禁最らぴ増真笑傍剰べくぱょ。助ノリイム性達ず児勝ゆぞき発早蚕モレ治簡ミノモウ国賞キケフイ傘相テロヤ見甲りルけ聞凡さふ勝心ょ協6目ウ援捕むひ朝尊厳式真ゃじ。

名ヲラ居真アヱシ質暮国にり区神受論キ触習がそ新下ーっか開被らえよむ和知ヤルマニ酷始今ごぐし公空かころの掲記ヌ芸面ょ直必サ弾升わりねず。力ラわはな復調ヱムヒ空景ノハコ技任ルばリけ職孝需ノアラ選金リラ周事エメヒテ家者知ゆなゅび天1新ぴドか棚米知リツ徳案ヲチ森2算成め。禁ラクロ使性映ずがも天8情ぶずよ者処責けやげ間74資ウ事取のれち百75真ずルあレ側離方情訴ふ。

葉先ノソウ写反エワト定写らふフゆ保約ぐげイの放家キカスヒ掲元彦会20家個ホナ反森ょざた受提むぴづ女方イハウ能責ツマタク際2院つべ支定ッかほ図主均ぐみ。議応び過込ざばけ先治ぐドげ然13定もねえし癒52載ケツト着別ぶ性送交ヒラ顔必ぽ場討ウソマ全備録てだ浜替ンリラ躍杯ドえあ後告せら。

統スコ根念む限泉90芸るぞさう応号ぶ庭口ヌクソホ元反け家備当社るにと追作ネリミホ出観ケハレネ集達ルけせろ見実どゃだ愁彰ウ年84朝浦うほ一健カオイホ情母亮凱ぶラ。針リんずラ済部よ査軽ヌル消19展そき代特ワ朝指ご渡記ン方関カヒ断新草ニク京離将旅児か。旅リあ産見イソヨト遊掲だク暗暮命リ読体でざかい南写ヘマムア経枚ヱワ出見チ分58部ぴと容面か代聞傷ル" 
fi


### Test 8 ###
if [[ $t8 == 1 || $tb == 1 ]]
then
    echo "${L_Green}\n [Test 8]\t Gorgian TESTsu${NC}"

    $PATH_TO_CLIENT $p_id "ლორემ იფსუმ დოლორ სით ამეთ, ფრი ინთეგრე მოლესთიაე თე, ასსუმ ნოსთერ ელაბორარეთ ეა უსუ, ად ეოს ცორფორა დისფუთათიონი. სედ ფუისსეთ რეფრეჰენდუნთ იდ. დუო ოფთიონ ვოციბუს ლუცილიუს ცუ. ფერ ორნათუს ინთერესსეთ ცომფლეცთითურ ად, თე სცრიფთა ლეგენდოს ვოლუფთათიბუს ნეც. ფუთენთ ნოსთრო ეუ ველ, აუდიამ ვირთუთე ფუისსეთ ად იუს.

ათ ნამ ალიი დეცორე ადოლესცენს. მეის ფუგით ვირთუთე ეოს ეა, ეუ ალიყუამ აფფეთერე ფერციფით მელ. უთ ფრი დებითის ფრობათუს იმფერდიეთ, უთ ნულლამ ნოსთერ მელ, მინიმ გრაეცი ნამ უთ. ცუმ ალბუციუს მანდამუს უთ.

ცუმ ად დოლორ რიდენს მინიმუმ. ესთ ათ სოლეათ სენთენთიაე, ფლათონემ ეურიფიდის ფერსეცუთი სეა ათ. ად ფრო ყუაესთიო სცრიბენთურ. ად დოლორ ევერთითურ ყუი, ინ ჰას დიცთა ელითრ. ველ ლაუდემ აცცუმსან უთ. ვერი ინიმიცუს თე ეუმ. ალთერა სანცთუს ფერიცულა ნამ ინ, ყუი ჰომერო აცცომმოდარე ეთ, ველ ეხ ფოსსე მოლესთიაე.

ნათუმ ველით ეამ ეა, ლუდუს თრაცთათოს ფრო ათ. ელით დელიცათა ცონსთითუთო ნე ფრი, ფოსიდონიუმ დისსენთიას ინთელლეგებათ მეი ად, ათ ფრი ენიმ მოლესთიე. ვერი ლაორეეთ ცუ ვის, ეხ ცლითა ობლიყუე ვიმ. მეი ცუ სოლუმ უთინამ ფორენსიბუს, ჰის ნე ეირმოდ აუდიამ. ნამ ალბუციუს ცონცეფთამ ნო, ან ვიხ ორათიო აცცუმსან რეფერრენთურ.

დუო სუმმო ათომორუმ ეთ. ელით მინიმ მუციუს ეხ ვის, ეი ველ დოცთუს ცივიბუს ფასთიდიი. ეთ ეთიამ ომნიუმ ინდოცთუმ ველ, ნეც ამეთ ნისლ ნო, ცუმ ცუ ილლუმ სენსერით. ანიმალ ცონცეფთამ ფოსიდონიუმ მეა ცუ, ნე მაზიმ უთინამ მელ, მეა ეთ ინანი ინვიდუნთ.

ფრო ნე ყუოდსი არგუმენთუმ, ფერთინაცია ცონთენთიონეს ინ იუს. ნამ ფროფრიაე ეფიცურეი იდ, ნო ნამ აეყუე დოლორუმ ნეგლეგენთურ. უთ ეუმ ნემორე გლორიათურ, ეთ ეამ ინერმის ფერთინახ ინთელლეგათ. თე იუს ნიბჰ ჯუსთო, სეა ცონგუე ასსენთიორ იდ. ფერსიუს ბონორუმ ყუაესთიო ნეც ნო.

ელეიფენდ ინიმიცუს ყუი ცუ, ნისლ ოფორთერე ფროდესსეთ იდ ჰის. ესთ ეხ ფრობო რეცთეყუე ეურიფიდის, უთ ნეც მინიმ მოლესთიე ანთიოფამ, დისცერე ელოყუენთიამ იდ ყუი. დოცენდი რეცთეყუე არგუმენთუმ ვის ცუ, ან ესსენთ ალიყუამ ფრაესენთ ვიხ. ვიხ ეი ეფიცური ინთელლეგამ. ნე ფრი ერათ ველით ლეგენდოს. ეა თალე თოთა ცორრუმფით სით, დოცთუს მანდამუს ეხ მელ, ეი ნეც ჰაბეო აცცუსამუს მოდერათიუს.

სით ნე ოფორთერე მნესარცჰუმ. ყუიდამ იუვარეთ ცუ დუო, დუო ეთიამ ბლანდით ფათრიოყუე ნე. სით ეა ფაცილისის ცონსეცთეთუერ, უსუ თანთას მოლლის ეა. ცუ ვირთუთე სენსერით ესთ, ეა ბრუთე ლუფთათუმ ჰას. დიცო ფოსსით სეა თე, ჰის ერიფუით აცცუსათა აცცუსამუს ეხ.

ფრი ეი თემფორ ინერმის. ფრო ინვიდუნთ ფრობათუს ინ, ნო დიცუნთ მენთითუმ თჰეოფჰრასთუს ველ. ვის დენიყუე ევერთითურ ათ, ვისი ვირის თე ფრი, მეი თე ცასე ფრინციფეს სიმილიყუე. ალიენუმ დესერუნთ მეი ათ, დუო ომნეს ფოსთეა ცეთერო ინ. თე ფურთო იგნოთა სინგულის ფრი, ეამ ფეუგაით ჰონესთათის ინციდერინთ თე. ნამ ათ დეცორე დელიცათისსიმი, ცუ ფრობათუს ურბანითას ეუმ.

ფრი ულლამცორფერ ინთერფრეთარის ათ, აუგუე ფოფულო ევერთითურ ნამ ად. თალე ათყუი რეფუდიანდაე სედ ინ, იდ ეუმ დიამ ერიფუით ოფფიციის. ვერეარ ცივიბუს სიმილიყუე ფრო ცუ, ესთ ინ სოლუმ დეთრახით დესერუნთ, ცუ ენიმ მაიორუმ ინთერფრეთარის ეოს." 
fi

echo "\nIf all was corrrectly display on your server terminal: Perfect, well done! 💪"











